#include <iostream>
#include <string>

using namespace std;

int main()
{
	setlocale(LC_ALL, "Russian");
	int N;
	cout << "vibor zadachi:";
	cin >> N;
	if (N == 1)//Дан номер дня – целое число от 1 до 31 и месяца — 
	{         //целое число в диапазоне 1–12 (1 — январь, 2 — февраль и т. д.). Вывести дату в виде текста (например, «пятое января»).
		int a = 0, b = 0;
		string d[31] = { "pervoe","vtoroe","tret'e","chetvertoe","pyatoe","shestoe","sed'moe","vos'moe","devyatoe","desyatoe","odinadcatoe","dvenadcatoe","trinnadcatoe","chetirnadcatoe","pyatnadcatoe","shestnadcatoe","semnadcatoe","vosemnadcatoe","devatnadcatoe","dvadcatoe","dvadcat' pervoe","dvadcat' vtoroe","dvadcat' trer'e","dvadcat' chetvertoe","dvadcat' pyatoe", "dvadcat' shestoe","dvadcat' sed'moe", "dvadcat' vos'moe", "dvadcati devyatoe", "tridcatoe","tridcat' pervoe" };
		string m[12] = { "yanvarya","fevralya","marta","aprelya","maya","iunya","iulya","augusta","sentyabrya","oktyabrya","noyabrya","dekaba'" };
		cout << "vvedite den' ot 1 do 31:";
		cin >> a;
		cout << "vvedite mesyac:";
		cin >> b;
		a--;
		b--;
		cout << d[a] << " ";
		cout << m[b];
	}//Робот может перемещаться в четырех направлениях 
	if (N == 2)//(«С» — север, «З» — запад, «Ю» — юг, «В» — восток) и принимать три цифровые команды:
	{ //0 — продолжать движение, 1 — поворот налево, −1 — поворот направо.Дан символ C — исходное направление робота
	 // и целое число N — посланная ему команда. Вывести направление робота после выполнения полученной команды
		int n, s = 0;//s S igraem
		cout << "1 levo . 3 pravo . 2 vpered . 4 exit" << endl; // N-север W-zapad E-vostok S-ug
		string arr[4] = { "W__N__E","N__E__S","E__S__W","S__W__N" };
		cout << arr[0] << endl;
		do
		{
			cout << "Komanda N"; //1 levo . 3 pravo . 2 vpered . tak ydobno
			cin >> n;
			if (n == 1)
			{
				s--;
			}
			if (n == 3)
			{
				s++;
			}
			if (s == 4 && n == 3)
			{
				s = 0;
			}
			if (s == -1 && n == 1)
			{
				s = 3;
			}
			cout << arr[s];
		} while (n != 4);
	}
	if (N == 3)//Дано целое число в диапазоне 10–40, определяющее количество учебных заданий по некоторой теме.
	{   //Вывести строку-описание указанного количества заданий, обеспечив правильное согласование числа со 
		//словами «учебное задание», например: 18 — «восемнадцать учебных заданий».
		int a;
		string arr[31] = { "десять учебных заданий", "одиннадцать учебных заданий","двенадцать учебных заданий","тринадцать учебных задании","четырнадцать учебных задании","пятнадцать учебных задании","шестнадцать учебных задании","семнадцать учебных задании","восемнадцать учебных задании","девятнадцать учебных задании","двадцать учебных задании","двадцать одно учебное задание","двадцать два учебных задания","двадцать три учебных задания","двадцать четыре учебных задания","двадцать пять учебных задания","двадцать шесть учебных задания","двадцать семь учебных задания","двадцать восемь учебных задания","двадцать девять учебных задания","тридцать учебных задании","тридцать одно учебное задание","тридцать два учебных задания","тридцать три учебных задании","тридцать четыре учебных задания","тридцать пять учебных задании","тридцать шесть учебных задании","тридцать семь учебных задании","тридцать восемь учебных задании","тридцать девять учебных задании","сорок учебных задании" };
		cout << "кол-во учебных заданий от 10 до 40:";
		cin >> a;
		cout << arr[a - 10];
	}//Дано целое число в диапазоне 100–999. 
	if (N == 4) //Вывести строку-описание данного числа, 
	{  //например: 256 — «двести пятьдесят шесть», 814 — «восемьсот четырнадцать».
		int a, x1, x2, x3;
		cout << "Введите чмсло от 100 до 999:";
		cin >> a;
		x1 = a / 100;
		x2 = (a - (x1 * 100)) / 10;
		x3 = (a - (x1 * 100) - (x2 * 10)) / 1;
		string arr1[9] = { "сто","двести","триста","четыреста","пятьсот","шестьсот","семьсот","восемьсот","девятьсот" }; // a%100==0
		string arr2[9] = { "десять","двадцать","тридцать","сорок","пятьдесят","шестьдесят","семьдесят","восемьдесят","девяносто" };  // a%10==0 and a<100 or a-^
		string arr3[9] = { "один","два","три","четыре","пять","шесть","семь","восемь","девять" };
		if (x2 == 1)
		{
			string arr4[9] = { "одиннадцать","двенадцать","тринадцать","четырнадцать","пятнадцать","шестнадцать","семнадцать","восемнадцать","девятнадцать" };
			x1--;
			x3--;
			cout << arr1[x1] << "  " << arr4[x3];
			return 0;
		}
		if (x2 == 0)
		{
			x1--;
			x3--;
			cout << arr1[x1] << "  " << arr3[x3];
			return 0;
		}
		if (x3 == 0)
		{
			x1--;
			x2--;
			cout << arr1[x1] << "  " << arr2[x2];
			return 0;
		}
		x1--;
		x2--;
		x3--;
		cout << arr1[x1] << "  " << arr2[x2] << "  " << arr3[x3];
	}//В восточном календаре принят 60-летний цикл, состоящий из 12- летних подциклов, обозначаемых названиями цвета: зеленый, 
	if (N == 5)//красный, желтый, белый и черный. В каждом подцикле годы носят 
	{      //названия животных: крысы, коровы, тигра, зайца, дракона, змеи, лошади, овцы, обезьяны, 
         //курицы, собаки и свиньи. По номеру года определить его название, если 1984 год — начало цикла: «год зеленой крысы».
		int a, x;
		//string arr1[5] = { "зелен","красн","желт","бел","черн" };
		//string arr2[12] = { "ой крысы","ой коровы","ого тигра","ого зайца","ого дракона","ой змеи","ой лошади","ой овцы","ой обезьяны","ой курицы","ой собаки","ой свиньи" };
		cout << "Введите год:";
		cin >> x;
		cout << "год ";
		switch (x % 1984 % 60 / 12)
		{
		case 0:
			cout << "зeлен";
			break;
		case 1:cout << "красн";
			break;
		case 2:cout << "желт";
			break;
		case 3:cout << "бел";
			break;
		case 4:cout << "черн";
			break;
		}
		switch (x % 1984 % 60 % 12)
		{
		case 0:cout << "ой крысы";
			break;
		case 1:cout << "ой коровы";
			break;
		case 2:cout << "ого тигра";
			break;
		case 3:cout << "ого зайца";
			break;
		case 4:cout << "ого дракона";
			break;
		case 5:cout << "ой змеи";
			break;
		case 6:cout << "ой лошади";
			break;
		case 7:cout << "ой овцы";
			break;
		case 8:cout << "ой обезьяны";
			break;
		case 9:cout << "ой курицы";
			break;
		case 10:cout << "ой собаки";
			break;
		case 11:cout << "ой овцы";
			break;
		}
	}
}